import {CHANGE_DNEVNIK} from '../actions';

const initialState = {
    // min: "25.05.23",
    // max: "01.09.23",
    reqWeek: [0],
    jur: {
        // "Англ. яз.": {
        //     "14.08.23": {
        //         0: {
        //             homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
        //             mark: 5,
        //             weight: 1,
        //             type: "Ответ на уроке"
        //         },
        //         1: {
        //             homework: "Упр. 5Стр. 103",
        //             mark: 2,
        //             weight: 1,
        //             type: "Ответ на уроке"
        //         },
        //         i: 0
        //     },
        //     "15.08.23": {
        //         0: {
        //             homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
        //             mark: 4,
        //             weight: 1,
        //             type: "Ответ на уроке"
        //         },
        //         i: 0
        //     }
        // },
        // "Окруж. мир": {
        //     "14.08.23": {
        //         0: {
        //             homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
        //             mark: 5,
        //             weight: 1,
        //             type: "Ответ на уроке"
        //         },
        //         1: {
        //             homework: "Упр. 5Стр. 103",
        //             mark: 2,
        //             weight: 1,
        //             type: "Ответ на уроке"
        //         },
        //         i: 0
        //     },
        //     "15.08.23": {
        //         0: {
        //             homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
        //             mark: 4,
        //             weight: 1,
        //             type: "Ответ на уроке"
        //         },
        //         i: 0
        //     }
        // }
    }
    // days: {
    //     "07.08.23": {
    //         lessons: {
    //             0: {
    //                 homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
    //                 mark: 5,
    //                 weight: 1,
    //                 type: "Ответ на уроке"
    //             },
    //             1: {
    //                 homework: "Стр. 18Упр. 328"
    //             },
    //             2: {
    //                 homework: "Стр. 36 №5, стр.37 N09"
    //             },
    //             3: {
    //                 homework: "Стр. 62-63 пересказ"
    //             }
    //         }
    //     },
    //     "15.05.22": {
    //         lessons: {
    //             0: {
    //                 homework: "Стр. 18Упр. 328"
    //             },
    //             1: {
    //                 homework: "Стр. 36 №5, стр.37 N09"
    //             },
    //             2: {
    //                 homework: "Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104Упр. 5Стр. 103,Упр. 2Стр. 104",
    //                 mark: 5,
    //                 weight: 2,
    //                 type: "Тест"
    //             },
    //             3: {
    //                 homework: "Стр. 18Упр. 328"
    //             },
    //             4: {
    //                 homework: "Стр. 36 №5, стр.37 N09"
    //             },
    //             5: {
    //                 homework: "Стр. 62-63 пересказ"
    //             }
    //         }
    //     },
    //     "16.05.22": {
    //         lessons: {
    //             0: {
    //                 homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
    //                 mark: 5,
    //                 weight: 1
    //             },
    //             1: {
    //                 homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
    //                 mark: 5,
    //                 weight: 1
    //             },
    //             2: {
    //                 homework: "Стр. 18Упр. 328"
    //             },
    //             3: {
    //                 homework: "Стр. 36 №5, стр.37 N09"
    //             },
    //             4: {
    //                 homework: "Стр. 62-63 пересказ"
    //             }
    //         }
    //     },
    //     "17.05.22": {
    //         lessons: {
    //             0: {
    //                 homework: "Стр. 36 №5, стр.37 N09"
    //             },
    //             1: {
    //                 homework: "Стр. 62-63 пересказ"
    //             }
    //         }
    //     },
    //     "18.05.22": {
    //         lessons: {
    //             0: {
    //                 homework: "Упр. 5Стр. 103,Упр. 2Стр. 104",
    //                 mark: 5,
    //                 weight: 1
    //             },
    //             1: {
    //                 homework: "Стр. 18Упр. 328"
    //             }
    //         }
    //     },
    //     "19.05.22": {
    //         lessons: {}
    //     },
    //     "20.05.22": {
    //         lessons: {}
    //     }
    // }
};

export default function dnevnikReducer(state = initialState, action) {
    let fd = {...state};
    switch(action.type) {
        case CHANGE_DNEVNIK:
            fd[action.payload.id] = action.payload.state;
            return fd;
        default:
            return state;
    }
}